In [68]:
import mysql.connector

conn = mysql.connector.connect(
    host='localhost',
    database='company',
    user='root',
    password='breach'
)
if conn.is_connected():
    print('db connection successfully')
else:
    print('error occurred in connecting to DB')

db connection successfully

In [22]:
# create table employee
cursor = conn.cursor()
try:
    cursor.execute('''
    CREATE TABLE `company`.`Employee` (
      `employee_id` INT NOT NULL AUTO_INCREMENT,
      `first_name` VARCHAR(100) NULL,
      `last_name` VARCHAR(100) NULL,
      `email` VARCHAR(45) NULL,
      `phone` VARCHAR(45) NULL,
      `hire_date` DATETIME NULL,
      `job_id` VARCHAR(45) NULL,
      `salary` INT NULL,
      `manager_id` VARCHAR(45) NULL,
      `department_id` VARCHAR(45) NULL,
      PRIMARY KEY (`employee_id`));
    ''')
    conn.commit()
    print('Employee table created successful')
except mysql.connector.Error as error:
    print("Error Occurred", error)
finally:
    pass
    # conn.close()

Error Occurred 1050 (42S01): Table 'Employee' already exists

In [25]:
# create table department
cursor = conn.cursor()
try:
    cursor.execute('''
    CREATE TABLE `company`.`Department` (
      `department_id` INT NOT NULL AUTO_INCREMENT,
      `department_name` VARCHAR(45) NULL,
      `location_id` VARCHAR(45) NULL,
      PRIMARY KEY (`department_id`));
    ''')
    conn.commit()
    print('Department table created successful')
except mysql.connector.Error as error:
    print("Error Occurred ", error)
finally:
    pass
    # cursor.close()

Error Occurred  1050 (42S01): Table 'Department' already exists

In [26]:
# create table jobs
cursor = conn.cursor()
try:
    cursor.execute('''
    CREATE TABLE `company`.`Jobs` (
      `job_id` INT NOT NULL AUTO_INCREMENT,
      `job_title` VARCHAR(45) NULL,
      `min_salary` INT NULL,
      `max_salary` INT NULL,
      PRIMARY KEY (`job_id`));
    ''')
    conn.commit()
    print('Jobs table created successful')
except mysql.connector.Error as error:
    print("Error Occurred ", error)
finally:
    pass

Error Occurred  1050 (42S01): Table 'Jobs' already exists

In [38]:
# insert data into the employee table

employee_data = [
    ('Antonette', 'Krajcik', 'frami.tremaine@example.com', '524-330-4576', '2009-02-12 04:55:25', '5', 3, '4', '5'),
    ('Darrell', 'Quigley', 'keeling.ellsworth@example.org', '880.314.7079x927', '1985-04-29 07:30:10', '5', 6, '7', '4'),
    ('Sterling', 'Kshlerin', 'sdouglas@example.net', '02582051463', '2000-05-09 22:59:22', '8', 6, '1', '8'),
    ('Petra', 'Haag', 'celine69@example.net', '666.309.5779', '1999-11-11 07:22:11', '4', 6, '3', '5'),
    ('Vivienne', 'Ebert', 'ismael86@example.com', '09423295201', '1974-08-02 01:19:26', '9', 6, '8', '3'),
    ('Petra', 'Thiel', 'triston.haag@example.org', '1-767-035-4896x5198', '2020-08-08 15:50:13', '2', 4, '2', '5'),
    ('Zula', 'Bergstrom', 'dbeahan@example.org', '382-001-7383x59947', '2008-10-12 13:10:02', '1', 4, '7', '9'),
    ('Sammie', 'Klein', 'muller.kiara@example.com', '730-482-4076x121', '2006-01-31 01:11:47', '4', 5, '6', '5'),
    ('Ernestine', 'Koss', 'leonor77@example.net', '(298)256-3267', '2020-10-20 04:02:06', '4', 4, '8', '5'),
    ('Ferne', 'Shields', 'amante@example.net', '04025586949', '1997-09-17 23:19:52', '4', 1, '5', '4')
]
cursor = conn.cursor()
employee_insert_sql ='''
INSERT INTO `company`.`Employee`
(`first_name`,
`last_name`,
`email`,
`phone`,
`hire_date`,
`job_id`,
`salary`,
`manager_id`,
`department_id`)
VALUES
(%s,%s,%s,%s,%s,%s,%s,%s,%s);
'''
try:
    cursor.executemany(employee_insert_sql,employee_data)
    print(cursor.rowcount, " Records inserted into employee table")
    conn.commit()
except mysql.connector.Error as error:
    print("Error Occurred ", error)
finally:
    pass

10  Records inserted into employee table

In [56]:
# insert data into the department table
department_data = [
    ('mesh B2C paradigms', '9'),
    ('incubate e-business users', '3'),
    ('aggregate dynamic models', '7'),
    ('morph rich architectures', '9'),
    ('facilitate plug-and-play systems', '2'),
    ('generate real-time webservices', '2'),
    ('repurpose world-class niches', '9'),
    ('matrix distributed architectures', '1'),
    ('expedite robust vortals', '3'),
    ('incubate leading-edge bandwidth', '4')
]

department_insert_sql= '''
INSERT INTO `company`.`Department`
(`department_name`,
`location_id`)
VALUES
(%s,%s);
'''

try:
    cursor.executemany(department_insert_sql,department_data)
    print(cursor.rowcount, " Records inserted into department table")
    conn.commit()
except mysql.connector.Error as error:
    print("Error Occurred ", error)
finally:
    pass

10  Records inserted into department table

In [55]:
# insert data into jobs table
jobs_data = [
    ('Armstrong Klein', 103, 7129),
    ('Roberts Funk and Kovacek', 962, 5986),
    ('Haag Gutmann', 424, 6584),
    ('Sporer Koelpin and Graham', 961, 4713),
    ('Dooley and Sons', 239, 5474),
    ('Smitham Mohr and Jast', 233, 4251),
    ('Swaniawski Wilkinson and Ritchie', 110, 7554),
    ('Aufderhar and Sons', 527, 9489),
    ('Mann Ltd', 279, 1146),
    ('Fadel LLC', 513, 1761)
]
cursor = conn.cursor()
jobs_insert_sql= '''
INSERT INTO `company`.`Jobs`
(`job_title`,
`min_salary`,
`max_salary`)
VALUES(
%s,%s,%s);
'''

try:
    cursor.executemany(jobs_insert_sql,jobs_data)
    print(cursor.rowcount, " Records inserted into Jobs table")
    conn.commit()
except mysql.connector.Error as error:
    print("Error Occurred ", error)
finally:
    pass

10  Records inserted into Jobs table

In [71]:
# fetch data in employee table
cursor = conn.cursor()
cursor.execute('SELECT * FROM Employee;')
departments = cursor.fetchall()
print(cursor.rowcount, " Employee (rows) fetched")
for department in departments:
    print(department)

30  Employee (rows) fetched
(1, 'Antonette', 'Krajcik', 'frami.tremaine@example.com', '524-330-4576', datetime.datetime(2009, 2, 12, 4, 55, 25), '5', 3, '4', '5')
(2, 'Darrell', 'Quigley', 'keeling.ellsworth@example.org', '880.314.7079x927', datetime.datetime(1985, 4, 29, 7, 30, 10), '5', 6, '7', '4')
(3, 'Sterling', 'Kshlerin', 'sdouglas@example.net', '02582051463', datetime.datetime(2000, 5, 9, 22, 59, 22), '8', 6, '1', '8')
(4, 'Petra', 'Haag', 'celine69@example.net', '666.309.5779', datetime.datetime(1999, 11, 11, 7, 22, 11), '4', 6, '3', '5')
(5, 'Vivienne', 'Ebert', 'ismael86@example.com', '09423295201', datetime.datetime(1974, 8, 2, 1, 19, 26), '9', 6, '8', '3')
(6, 'Petra', 'Thiel', 'triston.haag@example.org', '1-767-035-4896x5198', datetime.datetime(2020, 8, 8, 15, 50, 13), '2', 4, '2', '5')
(7, 'Zula', 'Bergstrom', 'dbeahan@example.org', '382-001-7383x59947', datetime.datetime(2008, 10, 12, 13, 10, 2), '1', 4, '7', '9')
(8, 'Sammie', 'Klein', 'muller.kiara@example.com', '730-482-4076x121', datetime.datetime(2006, 1, 31, 1, 11, 47), '4', 5, '6', '5')
(9, 'Ernestine', 'Koss', 'leonor77@example.net', '(298)256-3267', datetime.datetime(2020, 10, 20, 4, 2, 6), '4', 4, '8', '5')
(10, 'Ferne', 'Shields', 'amante@example.net', '04025586949', datetime.datetime(1997, 9, 17, 23, 19, 52), '4', 1, '5', '4')
(11, 'Antonette', 'Krajcik', 'frami.tremaine@example.com', '524-330-4576', datetime.datetime(2009, 2, 12, 4, 55, 25), '5', 3, '4', '5')
(12, 'Darrell', 'Quigley', 'keeling.ellsworth@example.org', '880.314.7079x927', datetime.datetime(1985, 4, 29, 7, 30, 10), '5', 6, '7', '4')
(13, 'Sterling', 'Kshlerin', 'sdouglas@example.net', '02582051463', datetime.datetime(2000, 5, 9, 22, 59, 22), '8', 6, '1', '8')
(14, 'Petra', 'Haag', 'celine69@example.net', '666.309.5779', datetime.datetime(1999, 11, 11, 7, 22, 11), '4', 6, '3', '5')
(15, 'Vivienne', 'Ebert', 'ismael86@example.com', '09423295201', datetime.datetime(1974, 8, 2, 1, 19, 26), '9', 6, '8', '3')
(16, 'Petra', 'Thiel', 'triston.haag@example.org', '1-767-035-4896x5198', datetime.datetime(2020, 8, 8, 15, 50, 13), '2', 4, '2', '5')
(17, 'Zula', 'Bergstrom', 'dbeahan@example.org', '382-001-7383x59947', datetime.datetime(2008, 10, 12, 13, 10, 2), '1', 4, '7', '9')
(18, 'Sammie', 'Klein', 'muller.kiara@example.com', '730-482-4076x121', datetime.datetime(2006, 1, 31, 1, 11, 47), '4', 5, '6', '5')
(19, 'Ernestine', 'Koss', 'leonor77@example.net', '(298)256-3267', datetime.datetime(2020, 10, 20, 4, 2, 6), '4', 4, '8', '5')
(20, 'Ferne', 'Shields', 'amante@example.net', '04025586949', datetime.datetime(1997, 9, 17, 23, 19, 52), '4', 1, '5', '4')
(21, 'Antonette', 'Krajcik', 'frami.tremaine@example.com', '524-330-4576', datetime.datetime(2009, 2, 12, 4, 55, 25), '5', 3, '4', '5')
(22, 'Darrell', 'Quigley', 'keeling.ellsworth@example.org', '880.314.7079x927', datetime.datetime(1985, 4, 29, 7, 30, 10), '5', 6, '7', '4')
(23, 'Sterling', 'Kshlerin', 'sdouglas@example.net', '02582051463', datetime.datetime(2000, 5, 9, 22, 59, 22), '8', 6, '1', '8')
(24, 'Petra', 'Haag', 'celine69@example.net', '666.309.5779', datetime.datetime(1999, 11, 11, 7, 22, 11), '4', 6, '3', '5')
(25, 'Vivienne', 'Ebert', 'ismael86@example.com', '09423295201', datetime.datetime(1974, 8, 2, 1, 19, 26), '9', 6, '8', '3')
(26, 'Petra', 'Thiel', 'triston.haag@example.org', '1-767-035-4896x5198', datetime.datetime(2020, 8, 8, 15, 50, 13), '2', 4, '2', '5')
(27, 'Zula', 'Bergstrom', 'dbeahan@example.org', '382-001-7383x59947', datetime.datetime(2008, 10, 12, 13, 10, 2), '1', 4, '7', '9')
(28, 'Sammie', 'Klein', 'muller.kiara@example.com', '730-482-4076x121', datetime.datetime(2006, 1, 31, 1, 11, 47), '4', 5, '6', '5')
(29, 'Ernestine', 'Koss', 'leonor77@example.net', '(298)256-3267', datetime.datetime(2020, 10, 20, 4, 2, 6), '4', 4, '8', '5')
(30, 'Ferne', 'Shields', 'amante@example.net', '04025586949', datetime.datetime(1997, 9, 17, 23, 19, 52), '4', 1, '5', '4')